Repository: tinelix/FrogFindPlus
Catalog: languages/*.strings
Languages: ru_ru

# encoding
source: ISO-8859-1
ru_ru: Windows-1251

# author
source: Sean
ru_ru: Vladimir Barinov (veselcraft)

# frogfind_description
source: The Search Engine for Vintage Computers
ru_ru: Поисковая система для винтажных компьютеров

source: Leap to
ru_ru: Запрос

# ribbbit_button
source: Ribbbit!
ru_ru: Найти!

# footer_author
source: Built by Action Retro on YouTube
ru_ru: Сайт создан YouTube-каналом Action Retro

# footer_about
source: Why build such a thing?
ru_ru: Зачем нужна эта штука? (на английском)

# footer_powered
source: Powered by DuckDuckGo
ru_ru: Работает с помощью DuckDuckGo

# search_results
source: Search Results for
ru_ru: Результаты поиска для запроса

# about_faq_short_description
source: A quick FAQ on an unconventional search engine
ru_ru: Краткий список ЧаВо, касательно необычной поисковой системы

# about_who_made_q
source: Who made FrogFind?
ru_ru: Кто создавал FrogFind?

# about_who_made_a
source: Hi, I'm Sean, A.K.A. <a href="https://youtube.com/ActionRetro">Action Retro</a> on YouTube. I work on a lot of 80's and 90's Macs (and other vintage machines), and I really like to try and get them online. However, the modern internet is not kind to old machines, which generally cannot handle the complicated javascript, CSS, and encryption that modern sites have. However, they can browse basic websites just fine. So I decided to see how much of the internet I could turn into basic websites, so that old machines can browse the modern internet once again!
ru_ru: Я Син, автор канала <a href="https://youtube.com/ActionRetro">Action Retro</a> на YouTube. Я много работаю с Маками 80-х and 90-х годов (и другими винтажными компьютерами) и мне очень нравится пытаться сделать так, чтобы они выходили в онлайн. Между прочим, современный Интернет не щадит старые ЭВМ, которые обычно не могут справляться со сложным JavaScript, CSS и шифрованием в современных сайтах. Они могут спокойно просматривать простые веб-сайты, поэтому я решил выяснить, какую часть Интернета я бы мог превратить в простые веб-сайты, чтобы старые машины снова смогли воспользоваться современным Интернетом!

# about_how_does_q
source: How does FrogFind work?
ru_ru: Как работает FrogFind?

# about_how_does_a
source: The search functionality of FrogFind is basically a custom wrapper for DuckDuckGo search, converting the results to extremely basic HTML that old browsers can read. When clicking through to pages from search results, those pages are processed through a <a href="https://github.com/fivefilters/readability.php" target="_blank">PHP port of Mozilla's Readability</a>, which is what powers Firefox's reader mode. I then further strip down the results to be as basic HTML as possible.
ru_ru: Функциональность поисковой системы FrogFind в основном является самодельной обёрткой над поисковиком DuckDuckGo, превращая результаты поиска в самые простые HTML-страницы, которые старые браузеры могут прочитать. При открытии страниц из результатов поиска, они обрабатываются <a href="https://github.com/fivefilters/readability.php" target="_blank">портированной версией Mozilla Readability на PHP</a>, которая в свою очередь основывается на режиме чтения Firefox, затем я ещё больше упрощаю результаты, сводя их к максимально простому HTML.

# about_what_machines_do_you_test_q
source: What machines do you test FrogFind on?
ru_ru: На каких машинах вы тестировали FrogFind?

# about_what_machines_do_you_test_a
source: I designed FrogFind with classic Macs in mind, so I've been testing on my SE/30 to make sure it looks good in 1 bit color with a 512x384 resolution. Most of my testing has been on Netscape 1.1N and 2.0.2, as well as a few 68k Mac versions of iCab. FrogFind should also work great on any text-based web browser!
ru_ru: Я разработал FrogFind с учётом на классические Маки, так как я тестировал на своём SE/30, чтобы убедиться, что он выглядит хорошо в 1-битном цвете с разрешением 512x384. Большая часть моего тестирования проходила на Netscape 1.1N и 2.0.2, а также на некоторых версиях iCab для Mac 68k. FrogFind должен также хорошо работать в любых текстовых браузерах!

# about_how_can_i_get_in_touch_q
source: How can I get in touch with you?
ru_ru: Как я могу к вам постучаться?

# about_how_can_i_get_in_touch_a
source: Send me an email! <a href="mailto:actionretro@pm.me">actionretro@pm.me
ru_ru: Пишите мне на почту! <a href="mailto:actionretro@pm.me">actionretro@pm.me (письмо должно быть написано на английском языке)

# about_frogfindplus_whats_difference_q
source: How is FrogFindPlus different from original FrogFind?
ru_ru: Чем отличается FrogFindPlus от обычной FrogFind?

# about_frogfindplus_whats_difference_a
source: FrogFindPlus - a direct fork of the original FrogFind. It features localization support (thanks to <a href="http://veselcraft.ru">Veselcraft</a> for that). Basic CSS support and some improvements may be added soon.
ru_ru: FrogFindPlus - прямое ответление (форк) оригинального FrogFind. Он отличается поддержкой локализации (за это спасибо <a href="http://veselcraft.ru">Веселкрафту</a>). Скоро может быть добавлена базовая поддержка CSS и некоторых улучшений.

# about_frogfindplus_who_translated_q
source: Who translated FrogFind into other languages, including Russian?
ru_ru: Кто перевёл FrogFind на другие языки, включая русский?

# about_frogfindplus_who_translated_a
source: FrogFind was partially translated by Vladimir Barinov, A.K.A. <a href="http://veselcraft.ru">Veselcraft</a>. Subsequently, the translation was improved by me (more precisely <a href="http://tinelix.ru">author of fork</a>).
ru_ru: FrogFind частично был переведен Владимиром Бариновым (известен под псевдонимом <a href="http://veselcraft.ru">Veselcraft</a>. Впоследствии, перевод был мной (точнее <a href="http://tinelix.ru">автором форка</a>) улучшен.

# about_frogfindplus_does_have_source_q
source: Does FrogFindPlus have source code?
ru_ru: У FrogFindPlus есть исходный код?

# about_frogfindplus_does_have_source_a
source: Yes, just like <a href="https://github.com/ActionRetro/FrogFind">FrogFind</a>, our fork has source code on GitHub - <a href="https://github.com/tinelix/FrogFindPlus">github.com/tinelix/FrogFindPlus</a>. Unfortunately, you'll have to visit the link on modern computers, but you can use a local proxy server and view the source code via Git.
ru_ru: Да, как и <a href="https://github.com/ActionRetro/FrogFind">FrogFind</a>, у нашего форка есть исходный код на GitHub - <a href="https://github.com/tinelix/FrogFindPlus">github.com/tinelix/FrogFindPlus</a>. К сожалению, вам придется заходить по ссылке на современных компьютерах, но вы можете воспользоваться локальным прокси-сервером и посмотреть исходный код через Git.

# back_to_frogfind
source: Back to
ru_ru: Вернуться в

source: Browsing URL
ru_ru: Адресная строка

source: Go!
ru_ru: Перейти!

# error_fail_to_fetch
source: Failed to get results, sorry :(
ru_ru: Не удалось выполнить поиск, извините :c

# error_not_webpage
source: That's not a web page :(
ru_ru: Это не веб-страница :(
